import os

# 1. Создаем канал связи (pipe): r - для чтения, w - для записи
r, w = os.pipe()

# 2. Клонируем процесс
pid = os.fork()

if pid == 0:
    # --- Этот код выполняется ТОЛЬКО в дочернем процессе (ребенке) ---
    os.close(r) # Ребенку не нужно читать, закрываем этот конец
    
    msg = f"Привет от ребенка, PID={os.getpid()}\n"
    os.write(w, msg.encode()) # Переводим текст в байты и отправляем
    
    os.close(w) # Закрываем за собой запись
    os._exit(0) # Завершаем работу дочернего процесса
else:
    # --- Этот код выполняется ТОЛЬКО в родительском процессе ---
    os.close(w) # Родителю не нужно писать, закрываем этот конец
    
    data = os.read(r, 1024) # Читаем данные из канала (до 1024 байт)
    os.close(r) # Закрываем чтение после получения данных
    
    os.waitpid(pid, 0) # Дожидаемся завершения ребенка, чтобы не плодить "зомби"
    
    # Декодируем байты обратно в текст и убираем лишние пробелы/переносы через .strip()
    print("Родитель получил:", data.decode().strip())
